export const initialLetters = [
	"ᄀ", "ᄁ", "ᄂ", "ᄃ", "ᄄ", "ᄅ", "ᄆ", "ᄇ", "ᄈ",
    "ᄉ", "ᄊ", "ᄋ", "ᄌ", "ᄍ", "ᄎ", "ᄏ", "ᄐ", "ᄑ", "ᄒ",
]

export const initialCompatLetters = [
	"ㄱ", "ㄲ", "ㄴ", "ㄷ", "ㄸ", "ㄹ", "ㅁ", "ㅂ", "ㅃ",
    "ㅅ", "ㅆ", "ㅇ", "ㅈ", "ㅉ", "ㅊ", "ㅋ", "ㅌ", "ㅍ", "ㅎ",
]

export const initialSplitLetters = [
	"ᄀ", ["ᄀ", "ᄀ"], "ᄂ", "ᄃ", ["ᄃ", "ᄃ"], "ᄅ", "ᄆ", "ᄇ", ["ᄇ", "ᄇ"],
    "ᄉ", ["ᄉ", "ᄉ"], "ᄋ", "ᄌ", ["ᄌ", "ᄌ"], "ᄎ", "ᄏ", "ᄐ", "ᄑ", "ᄒ",
]

export const initialSplitCompatLetters = [
	"ㄱ", ["ㄱ", "ㄱ"], "ㄴ", "ㄷ", ["ㄷ", "ㄷ"], "ㄹ", "ㅁ", "ㅂ", ["ㅂ", "ㅂ"],
    "ㅅ", ["ㅅ", "ㅅ"], "ㅇ", "ㅈ", ["ㅈ", "ㅈ"], "ㅊ", "ㅋ", "ㅌ", "ㅍ", "ㅎ",
]

export const medialLetters = [
	"ᅡ", "ᅢ", "ᅣ", "ᅤ", "ᅥ", "ᅦ", "ᅧ", "ᅨ", "ᅩ",
    "ᅪ", "ᅫ", "ᅬ", "ᅭ", "ᅮ", "ᅯ", "ᅰ", "ᅱ", "ᅲ",
    "ᅳ", "ᅴ", "ᅵ",
]

export const medialCompatLetters = [
	"ㅏ", "ㅐ", "ㅑ", "ㅒ", "ㅓ", "ㅔ", "ㅕ", "ㅖ", "ㅗ",
    "ㅘ", "ㅙ", "ㅚ", "ㅛ", "ㅜ", "ㅝ", "ㅞ", "ㅟ", "ㅠ",
    "ㅡ", "ㅢ", "ㅣ",
]

export const medialSplitLetters = [
	"ᅡ", "ᅢ", "ᅣ", "ᅤ", "ᅥ", "ᅦ", "ᅧ", "ᅨ", "ᅩ",
    ["ᅩ", "ᅡ"], ["ᅩ", "ᅢ"], ["ᅩ", "ᅵ"], "ᅭ", "ᅮ", ["ᅮ", "ᅥ"], ["ᅮ", "ᅦ"],
    ["ᅮ", "ᅵ"], "ᅲ", "ᅳ", ["ᅳ", "ᅵ"], "ᅵ",
]

export const medialSplitCompatLetters = [
	"ㅏ", "ㅐ", "ㅑ", "ㅒ", "ㅓ", "ㅔ", "ㅕ", "ㅖ", "ㅗ",
    ["ㅗ", "ㅏ"], ["ㅗ", "ㅐ"], ["ㅗ", "ㅣ"], "ㅛ", "ㅜ", ["ㅜ", "ㅓ"], ["ㅜ", "ㅔ"],
    ["ㅜ", "ㅣ"], "ㅠ", "ㅡ", ["ㅡ", "ㅣ"], "ㅣ",
]

export const finalLetters = [
	"", "ᆨ", "ᆩ", "ᆪ", "ᆫ", "ᆬ", "ᆭ", "ᆮ", "ᆯ",
    "ᆰ", "ᆱ", "ᆲ", "ᆳ", "ᆴ", "ᆵ",	"ᆶ", "ᆷ", "ᆸ",
    "ᆹ", "ᆺ", "ᆻ", "ᆼ", "ᆽ", "ᆾ", "ᆿ", "ᇀ", "ᇁ", "ᇂ",
]

export const finalCompatLetters = [
	"", "ㄱ", "ㄲ", "ㄳ", "ㄴ", "ㄵ", "ㄶ", "ㄷ", "ㄹ",
    "ㄺ", "ㄻ", "ㄼ", "ㄽ", "ㄾ", "ㄿ",	"ㅀ", "ㅁ", "ㅂ",
    "ㅄ", "ㅅ", "ㅆ", "ㅇ", "ㅈ", "ㅊ", "ㅋ", "ㅌ", "ㅍ", "ㅎ",
]

export const finalSplitLetters = [
	"", "ᆨ", ["ᆨ", "ᆨ"], ["ᆨ", "ᆺ"], "ᆫ", ["ᆫ", "ᆽ"], ["ᆫ", "ᇂ"], "ᆮ", "ᆯ",
    ["ᆯ", "ᆨ"], ["ᆯ", "ᆷ"], ["ᆯ", "ᆸ"], ["ᆯ", "ᆺ"], ["ᆯ", "ᇀ"], ["ᆯ", "ᇁ"],
    ["ᆯ", "ᇂ"], "ᆷ", "ᆸ", ["ᆸ", "ᆺ"], "ᆺ", ["ᆺ", "ᆺ"], "ᆼ", "ᆽ", "ᆾ", "ᆿ",
    "ᇀ", "ᇁ", "ᇂ",
]

export const finalSplitCompatLetters = [
	"", "ㄱ", ["ㄱ", "ㄱ"], ["ㄱ", "ㅅ"], "ㄴ", ["ㄴ", "ㅈ"], ["ㄴ", "ㅎ"], "ㄷ", "ㄹ",
    ["ㄹ", "ㄱ"], ["ㄹ", "ㅁ"], ["ㄹ", "ㅂ"], ["ㄹ", "ㅅ"], ["ㄹ", "ㅌ"], ["ㄹ", "ㅍ"],
    ["ㄹ", "ㅎ"], "ㅁ", "ㅂ", ["ㅂ", "ㅅ"], "ㅅ", ["ㅅ", "ㅅ"], "ㅇ", "ㅈ", "ㅊ", "ㅋ",
    "ㅌ", "ㅍ", "ㅎ",
]