export const initialLetters = [
	"ᄀ", "ᄁ", "ᄂ", "ᄃ", "ᄄ", "ᄅ", "ᄆ", "ᄇ", "ᄈ",
    "ᄉ", "ᄊ", "ᄋ", "ᄌ", "ᄍ", "ᄎ", "ᄏ", "ᄐ", "ᄑ", "ᄒ",
]

export const initialCompatLetters = [
	"ㄱ", "ㄲ", "ㄴ", "ㄷ", "ㄸ", "ㄹ", "ㅁ", "ㅂ", "ㅃ",
    "ㅅ", "ㅆ", "ㅇ", "ㅈ", "ㅉ", "ㅊ", "ㅋ", "ㅌ", "ㅍ", "ㅎ",
]

export const initialSplitLetters = [
	"ᄀ", ["ᄀ", "ᄀ"], "ᄂ", "ᄃ", ["ᄃ", "ᄃ"], "ᄅ", "ᄆ", "ᄇ", ["ᄇ", "ᄇ"],
    "ᄉ", ["ᄉ", "ᄉ"], "ᄋ", "ᄌ", ["ᄌ", "ᄌ"], "ᄎ", "ᄏ", "ᄐ", "ᄑ", "ᄒ",
]

export const initialSplitCompatLetters = [
	"ㄱ", ["ㄱ", "ㄱ"], "ㄴ", "ㄷ", ["ㄷ", "ㄷ"], "ㄹ", "ㅁ", "ㅂ", ["ㅂ", "ㅂ"],
    "ㅅ", ["ㅅ", "ㅅ"], "ㅇ", "ㅈ", ["ㅈ", "ㅈ"], "ㅊ", "ㅋ", "ㅌ", "ㅍ", "ㅎ",
]

export const medialLetters = [
	"ᅡ", "ᅢ", "ᅣ", "ᅤ", "ᅥ", "ᅦ", "ᅧ", "ᅨ", "ᅩ",
    "ᅪ", "ᅫ", "ᅬ", "ᅭ", "ᅮ", "ᅯ", "ᅰ", "ᅱ", "ᅲ",
    "ᅳ", "ᅴ", "ᅵ",
]

export const medialCompatLetters = [
	"ㅏ", "ㅐ", "ㅑ", "ㅒ", "ㅓ", "ㅔ", "ㅕ", "ㅖ", "ㅗ",
    "ㅘ", "ㅙ", "ㅚ", "ㅛ", "ㅜ", "ㅝ", "ㅞ", "ㅟ", "ㅠ",
    "ㅡ", "ㅢ", "ㅣ",
]

export const medialSplitLetters = [
	"ᅡ", "ᅢ", "ᅣ", "ᅤ", "ᅥ", "ᅦ", "ᅧ", "ᅨ", "ᅩ",
    ["ᅩ", "ᅡ"], ["ᅩ", "ᅢ"], ["ᅩ", "ᅵ"], "ᅭ", "ᅮ", ["ᅮ", "ᅥ"], ["ᅮ", "ᅦ"],
    ["ᅮ", "ᅵ"], "ᅲ", "ᅳ", ["ᅳ", "ᅵ"], "ᅵ",
]

export const medialSplitCompatLetters = [
	"ㅏ", "ㅐ", "ㅑ", "ㅒ", "ㅓ", "ㅔ", "ㅕ", "ㅖ", "ㅗ",
    ["ㅗ", "ㅏ"], ["ㅗ", "ㅐ"], ["ㅗ", "ㅣ"], "ㅛ", "ㅜ", ["ㅜ", "ㅓ"], ["ㅜ", "ㅔ"],
    ["ㅜ", "ㅣ"], "ㅠ", "ㅡ", ["ㅡ", "ㅣ"], "ㅣ",
]

export const finalLetters = [
	"", "ᆨ", "ᆩ", "ᆪ", "ᆫ", "ᆬ", "ᆭ", "ᆮ", "ᆯ",
    "ᆰ", "ᆱ", "ᆲ", "ᆳ", "ᆴ", "ᆵ", "ᆶ", "ᆷ", "ᆸ",
    "ᆹ", "ᆺ", "ᆻ", "ᆼ", "ᆽ", "ᆾ", "ᆿ", "ᇀ", "ᇁ", "ᇂ",
]

export const finalCompatLetters = [
	"", "ㄱ", "ㄲ", "ㄳ", "ㄴ", "ㄵ", "ㄶ", "ㄷ", "ㄹ",
    "ㄺ", "ㄻ", "ㄼ", "ㄽ", "ㄾ", "ㄿ",	"ㅀ", "ㅁ", "ㅂ",
    "ㅄ", "ㅅ", "ㅆ", "ㅇ", "ㅈ", "ㅊ", "ㅋ", "ㅌ", "ㅍ", "ㅎ",
]

export const finalSplitLetters = [
	"", "ᆨ", ["ᆨ", "ᆨ"], ["ᆨ", "ᆺ"], "ᆫ", ["ᆫ", "ᆽ"], ["ᆫ", "ᇂ"], "ᆮ", "ᆯ",
    ["ᆯ", "ᆨ"], ["ᆯ", "ᆷ"], ["ᆯ", "ᆸ"], ["ᆯ", "ᆺ"], ["ᆯ", "ᇀ"], ["ᆯ", "ᇁ"],
    ["ᆯ", "ᇂ"], "ᆷ", "ᆸ", ["ᆸ", "ᆺ"], "ᆺ", ["ᆺ", "ᆺ"], "ᆼ", "ᆽ", "ᆾ", "ᆿ",
    "ᇀ", "ᇁ", "ᇂ",
]

export const finalSplitCompatLetters = [
	"", "ㄱ", ["ㄱ", "ㄱ"], ["ㄱ", "ㅅ"], "ㄴ", ["ㄴ", "ㅈ"], ["ㄴ", "ㅎ"], "ㄷ", "ㄹ",
    ["ㄹ", "ㄱ"], ["ㄹ", "ㅁ"], ["ㄹ", "ㅂ"], ["ㄹ", "ㅅ"], ["ㄹ", "ㅌ"], ["ㄹ", "ㅍ"],
    ["ㄹ", "ㅎ"], "ㅁ", "ㅂ", ["ㅂ", "ㅅ"], "ㅅ", ["ㅅ", "ㅅ"], "ㅇ", "ㅈ", "ㅊ", "ㅋ",
    "ㅌ", "ㅍ", "ㅎ",
]

export const compatLetters = [
    "ㄱ", "ㄲ", "ㄳ", "ㄴ", "ㄵ", "ㄶ", "ㄷ", "ㄸ", "ㄹ", "ㄺ", "ㄻ", "ㄼ",
    "ㄽ", "ㄾ", "ㄿ", "ㅀ", "ㅁ", "ㅂ", "ㅃ", "ㅄ", "ㅅ", "ㅆ", "ㅇ", "ㅈ",
    "ㅉ", "ㅊ", "ㅋ", "ㅌ", "ㅍ", "ㅎ", "ㅏ", "ㅐ", "ㅑ", "ㅒ", "ㅓ", "ㅔ",
    "ㅕ", "ㅖ", "ㅗ", "ㅘ", "ㅙ", "ㅚ", "ㅛ", "ㅜ", "ㅝ", "ㅞ", "ㅟ", "ㅠ",
    "ㅡ", "ㅢ", "ㅣ",
]

export const consonantLetters = [
    "ㄱ", "ㄲ", "ㄳ", "ㄴ", "ㄵ", "ㄶ", "ㄷ", "ㄸ", "ㄹ", "ㄺ", "ㄻ", "ㄼ",
    "ㄽ", "ㄾ", "ㄿ", "ㅀ", "ㅁ", "ㅂ", "ㅃ", "ㅄ", "ㅅ", "ㅆ", "ㅇ", "ㅈ",
    "ㅉ", "ㅊ", "ㅋ", "ㅌ", "ㅍ", "ㅎ", "ᄀ", "ᄁ", "ᄂ", "ᄃ", "ᄄ", "ᄅ",
    "ᄆ", "ᄇ", "ᄈ", "ᄉ", "ᄊ", "ᄋ", "ᄌ", "ᄍ", "ᄎ", "ᄏ", "ᄐ", "ᄑ",
    "ᄒ", "ᆨ", "ᆩ", "ᆪ", "ᆫ", "ᆬ", "ᆭ", "ᆮ", "ᆯ", "ᆰ", "ᆱ", "ᆲ",
    "ᆳ", "ᆴ", "ᆵ", "ᆶ", "ᆷ", "ᆸ", "ᆹ", "ᆺ", "ᆻ", "ᆼ", "ᆽ", "ᆾ",
    "ᆿ",  "ᇀ", "ᇁ", "ᇂ",
]

export const vowelLetters = [
    "ㅏ", "ㅐ", "ㅑ", "ㅒ", "ㅓ", "ㅔ", "ㅕ", "ㅖ", "ㅗ", "ㅘ", "ㅙ", "ㅚ",
    "ㅛ", "ㅜ", "ㅝ", "ㅞ", "ㅟ", "ㅠ", "ㅡ", "ㅢ", "ㅣ", "ᅡ", "ᅢ", "ᅣ",
    "ᅤ", "ᅥ", "ᅦ", "ᅧ", "ᅨ", "ᅩ", "ᅪ", "ᅫ", "ᅬ", "ᅭ", "ᅮ", "ᅯ",
    "ᅰ", "ᅱ", "ᅲ", "ᅳ", "ᅴ", "ᅵ",
]

export const iotizedVowelLetters = [
    "ㅑ", "ㅒ", "ㅕ", "ㅖ", "ㅛ", "ㅠ", "ᅣ", "ᅤ", "ᅧ", "ᅨ", "ᅭ", "ᅲ",
]

export const compositeLetters = [
    "ㄲ", "ㄳ", "ㄵ", "ㄶ", "ㄸ", "ㄺ", "ㄻ", "ㄼ", "ㄽ", "ㄾ", "ㄿ", "ㅀ",
    "ㅃ", "ㅄ", "ㅆ", "ㅉ", "ㅘ", "ㅙ", "ㅚ", "ㅝ", "ㅞ", "ㅟ", "ㅢ", "ᄁ",
    "ᄄ", "ᄈ", "ᄊ", "ᄍ", "ᅪ", "ᅫ", "ᅬ", "ᅯ", "ᅰ", "ᅱ", "ᅴ", "ᆩ",
    "ᆪ", "ᆬ", "ᆭ", "ᆰ", "ᆱ", "ᆲ", "ᆳ", "ᆴ", "ᆵ", "ᆶ", "ᆹ", "ᆻ",
]

export const doubleConsonantLetters = [
    "ㄲ", "ㄸ", "ㅃ", "ㅆ", "ㅉ"
]

export const toCompatMap = [
    ["ᄀ", "ㄱ"], ["ᄁ", "ㄲ"], ["ᄂ", "ㄴ"], ["ᄃ", "ㄷ"], ["ᄄ", "ㄸ"],
    ["ᄅ", "ㄹ"], ["ᄆ", "ㅁ"], ["ᄇ", "ㅂ"], ["ᄈ", "ㅃ"], ["ᄉ", "ㅅ"],
    ["ᄊ", "ㅆ"], ["ᄋ", "ㅇ"], ["ᄌ", "ㅈ"], ["ᄍ", "ㅉ"], ["ᄎ", "ㅊ"],
    ["ᄏ", "ㅋ"], ["ᄐ", "ㅌ"], ["ᄑ", "ㅍ"], ["ᄒ", "ㅎ"],
    ["ᅡ", "ㅏ"], ["ᅢ", "ㅐ"], ["ᅣ", "ㅑ"], ["ᅤ", "ㅒ"], ["ᅥ", "ㅓ"],
    ["ᅦ", "ㅔ"], ["ᅧ", "ㅕ"], ["ᅨ", "ㅖ"], ["ᅩ", "ㅗ"], ["ᅪ", "ㅘ"],
    ["ᅫ", "ㅙ"], ["ᅬ", "ㅚ"], ["ᅭ", "ㅛ"], ["ᅮ", "ㅜ"], ["ᅯ", "ㅝ"],
    ["ᅰ", "ㅞ"], ["ᅱ", "ㅟ"], ["ᅲ", "ㅠ"], ["ᅳ", "ㅡ"], ["ᅴ", "ㅢ"],
    ["ᅵ", "ㅣ"],
    ["ᆨ", "ㄱ"], ["ᆩ", "ㄲ"], ["ᆪ", "ㄳ"], ["ᆫ", "ㄴ"], ["ᆬ", "ㄵ"],
    ["ᆭ", "ㄶ"], ["ᆮ", "ㄷ"], ["ᆯ", "ㄹ"], ["ᆰ", "ㄺ"], ["ᆱ", "ㄻ"],
    ["ᆲ", "ㄼ"], ["ᆳ", "ㄽ"], ["ᆴ", "ㄾ"], ["ᆵ", "ㄿ"], ["ᆶ", "ㅀ"],
    ["ᆷ", "ㅁ"], ["ᆸ", "ㅂ"], ["ᆹ", "ㅄ"], ["ᆺ", "ㅅ"], ["ᆻ", "ㅆ"],
    ["ᆼ", "ㅇ"], ["ᆽ", "ㅈ"], ["ᆾ", "ㅊ"], ["ᆿ", "ㅋ"], ["ᇀ", "ㅌ"],
    ["ᇁ", "ㅍ"], ["ᇂ", "ㅎ"],
]

export const toInitialMap = [
    ["ㄱ", "ᄀ"], ["ㄲ", "ᄁ"], ["ㄴ", "ᄂ"], ["ㄷ", "ᄃ"], ["ㄸ", "ᄄ"],
    ["ㄹ", "ᄅ"], ["ㅁ", "ᄆ"], ["ㅂ", "ᄇ"], ["ㅃ", "ᄈ"], ["ㅅ", "ᄉ"],
    ["ㅆ", "ᄊ"], ["ㅇ", "ᄋ"], ["ㅈ", "ᄌ"], ["ㅉ", "ᄍ"], ["ㅊ", "ᄎ"],
    ["ㅋ", "ᄏ"], ["ㅌ", "ᄐ"], ["ㅍ", "ᄑ"], ["ㅎ", "ᄒ"], 
    ["ᆨ", "ᄀ"], ["ᆩ", "ᄁ"], ["ᆫ", "ᄂ"], ["ᆮ", "ᄃ"], ["ᆯ", "ᄅ"], 
    ["ᆷ", "ᄆ"], ["ᆸ", "ᄇ"], ["ᆺ", "ᄉ"], ["ᆻ", "ᄊ"], ["ᆼ", "ᄋ"],
    ["ᆽ", "ᄌ"], ["ᆾ", "ᄎ"], ["ᆿ", "ᄏ"], ["ᇀ", "ᄐ"], ["ᇁ", "ᄑ"],
    ["ᇂ", "ᄒ"],
]

export const compatToInitialMap = [
    ["ㄱ", "ᄀ"], ["ㄲ", "ᄁ"], ["ㄴ", "ᄂ"], ["ㄷ", "ᄃ"], ["ㄸ", "ᄄ"],
    ["ㄹ", "ᄅ"], ["ㅁ", "ᄆ"], ["ㅂ", "ᄇ"], ["ㅃ", "ᄈ"], ["ㅅ", "ᄉ"],
    ["ㅆ", "ᄊ"], ["ㅇ", "ᄋ"], ["ㅈ", "ᄌ"], ["ㅉ", "ᄍ"], ["ㅊ", "ᄎ"],
    ["ㅋ", "ᄏ"], ["ㅌ", "ᄐ"], ["ㅍ", "ᄑ"], ["ㅎ", "ᄒ"],
]

export const toMedialMap = [
    ["ㅏ", "ᅡ"], ["ㅐ", "ᅢ"], ["ㅑ", "ᅣ"], ["ㅒ", "ᅤ"], ["ㅓ", "ᅥ"],
    ["ㅔ", "ᅦ"], ["ㅕ", "ᅧ"], ["ㅖ", "ᅨ"], ["ㅗ", "ᅩ"], ["ㅘ", "ᅪ"],
    ["ㅙ", "ᅫ"], ["ㅚ", "ᅬ"], ["ㅛ", "ᅭ"], ["ㅜ", "ᅮ"], ["ㅝ", "ᅯ"],
    ["ㅞ", "ᅰ"], ["ㅟ", "ᅱ"], ["ㅠ", "ᅲ"], ["ㅡ", "ᅳ"], ["ㅢ", "ᅴ"],
    ["ㅣ", "ᅵ"],
]

export const compatToMedialMap = [
	["ㅏ", "ᅡ"], ["ㅐ", "ᅢ"], ["ㅑ", "ᅣ"], ["ㅒ", "ᅤ"], ["ㅓ", "ᅥ"],
    ["ㅔ", "ᅦ"], ["ㅕ", "ᅧ"], ["ㅖ", "ᅨ"], ["ㅗ", "ᅩ"], ["ㅘ", "ᅪ"],
    ["ㅙ", "ᅫ"], ["ㅚ", "ᅬ"], ["ㅛ", "ᅭ"], ["ㅜ", "ᅮ"], ["ㅝ", "ᅯ"],
    ["ㅞ", "ᅰ"], ["ㅟ", "ᅱ"], ["ㅠ", "ᅲ"], ["ㅡ", "ᅳ"], ["ㅢ", "ᅴ"],
    ["ㅣ", "ᅵ"],
]

export const toFinalMap = [
    ["ᄀ", "ᆨ"], ["ᄁ", "ᆩ"], ["ᄂ", "ᆫ"], ["ᄃ", "ᆮ"], ["ᄅ", "ᆯ"],
    ["ᄆ", "ᆷ"], ["ᄇ", "ᆸ"], ["ᄉ", "ᆺ"], ["ᄊ", "ᆻ"], ["ᄋ", "ᆼ"],
    ["ᄌ", "ᆽ"], ["ᄎ", "ᆾ"], ["ᄏ", "ᆿ"], ["ᄐ", "ᇀ"], ["ᄑ", "ᇁ"],
    ["ᄒ", "ᇂ"],
    ["ㄱ", "ᆨ"], ["ㄲ", "ᆩ"], ["ㄳ", "ᆪ"], ["ㄴ", "ᆫ"], ["ㄵ", "ᆬ"],
    ["ㄶ", "ᆭ"], ["ㄷ", "ᆮ"], ["ㄹ", "ᆯ"], ["ㄺ", "ᆰ"], ["ㄻ", "ᆱ"],
    ["ㄼ", "ᆲ"], ["ㄽ", "ᆳ"], ["ㄾ", "ᆴ"], ["ㄿ", "ᆵ"], ["ㅀ", "ᆶ"],
    ["ㅁ", "ᆷ"], ["ㅂ", "ᆸ"], ["ㅄ", "ᆹ"], ["ㅅ", "ᆺ"], ["ㅆ", "ᆻ"],
    ["ㅇ", "ᆼ"], ["ㅈ", "ᆽ"], ["ㅊ", "ᆾ"], ["ㅋ", "ᆿ"], ["ㅌ", "ᇀ"],
    ["ㅍ", "ᇁ"], ["ㅎ", "ᇂ"],
]

export const compatToFinalMap = [
    ["ㄱ", "ᆨ"], ["ㄲ", "ᆩ"], ["ㄳ", "ᆪ"], ["ㄴ", "ᆫ"], ["ㄵ", "ᆬ"],
    ["ㄶ", "ᆭ"], ["ㄷ", "ᆮ"], ["ㄹ", "ᆯ"], ["ㄺ", "ᆰ"], ["ㄻ", "ᆱ"],
    ["ㄼ", "ᆲ"], ["ㄽ", "ᆳ"], ["ㄾ", "ᆴ"], ["ㄿ", "ᆵ"], ["ㅀ", "ᆶ"],
    ["ㅁ", "ᆷ"], ["ㅂ", "ᆸ"], ["ㅄ", "ᆹ"], ["ㅅ", "ᆺ"], ["ㅆ", "ᆻ"],
    ["ㅇ", "ᆼ"], ["ㅈ", "ᆽ"], ["ㅊ", "ᆾ"], ["ㅋ", "ᆿ"], ["ㅌ", "ᇀ"],
    ["ㅍ", "ᇁ"], ["ㅎ", "ᇂ"],
]

export const compatToCompositeMap = [
    ["ㄱㄱ", "ㄲ"],	["ㄱㅅ", "ㄳ"],	["ㄴㅈ", "ㄵ"],	["ㄴㅎ", "ㄶ"],	["ㄷㄷ", "ㄸ"],
    ["ㄹㄱ", "ㄺ"],	["ㄹㅁ", "ㄻ"],	["ㄹㅂ", "ㄼ"],	["ㄹㅅ", "ㄽ"],	["ㄹㅌ", "ㄾ"],
    ["ㄹㅍ", "ㄿ"],	["ㄹㅎ", "ㅀ"],	["ㅂㅂ", "ㅃ"],	["ㅂㅅ", "ㅄ"],	["ㅅㅅ", "ㅆ"],
    ["ㅈㅈ", "ㅉ"],	["ㅗㅏ", "ㅘ"],	["ㅗㅐ", "ㅙ"],	["ㅗㅣ", "ㅚ"],	["ㅜㅓ", "ㅝ"],
    ["ㅜㅔ", "ㅞ"],	["ㅜㅣ", "ㅟ"],	["ㅡㅣ", "ㅢ"],
]

export const toIotizedMap = [    
    ["ㅏ", "ㅑ"], ["ㅐ", "ㅒ"], ["ㅓ", "ㅕ"], ["ㅔ", "ㅖ"], ["ㅗ", "ㅛ"], ["ㅜ", "ㅠ"],
    ["ᅡ", "ᅣ"], ["ᅢ", "ᅤ"], ["ᅥ", "ᅧ"], ["ᅦ", "ᅨ"], ["ᅩ", "ᅭ"], ["ᅮ", "ᅲ"],
]

export const toAspiratedMap = [
    ["ㄱ", "ㅋ"], ["ㄲ", "ㅋ"], ["ㄷ", "ㅌ"], ["ㄸ", "ㅌ"], ["ㅂ", "ㅍ"], ["ㅃ", "ㅍ"],
    ["ㅅ", "ㅆ"], ["ㅈ", "ㅊ"], ["ㅉ", "ㅊ"],
    ["ᄀ", "ᄏ"], ["ᄁ", "ᄏ"], ["ᄃ", "ᄐ"], ["ᄄ", "ᄐ"], ["ᄇ", "ᄑ"], ["ᄈ", "ᄑ"],
    ["ᄉ", "ᄊ"], ["ᄌ", "ᄎ"], ["ᄍ", "ᄎ"],
    ["ᆨ", "ᆿ"], ["ᆩ", "ᆿ"], ["ᆮ", "ᇀ"], ["ᆸ", "ᇁ"], ["ᆺ", "ᆻ"], ["ᆽ", "ᆾ"],
]

export const toFortisMap = [
    ["ㄱ", "ㄲ"], ["ㅋ", "ㄲ"], ["ㄷ", "ㄸ"], ["ㅌ", "ㄸ"], ["ㅂ", "ㅃ"], ["ㅍ", "ㅃ"],
    ["ㅅ", "ㅆ"], ["ㅈ", "ㅉ"], ["ㅊ", "ㅉ"],
    ["ᄀ", "ᄁ"], ["ᄏ", "ᄁ"], ["ᄃ", "ᄄ"], ["ᄐ", "ᄄ"], ["ᄇ", "ᄈ"], ["ᄑ", "ᄈ"],
    ["ᄉ", "ᄊ"], ["ᄌ", "ᄍ"], ["ᄎ", "ᄍ"],
    ["ᆨ", "ᆩ"], ["ᆿ", "ᆩ"], ["ᆺ", "ᆻ"],
]

export const toLenisMap = [
    ["ㄲ", "ㄱ"], ["ㅋ", "ㄱ"], ["ㄸ", "ㄷ"], ["ㅌ", "ㄷ"], ["ㅃ", "ㅂ"], ["ㅍ", "ㅂ"],
    ["ㅆ", "ㅅ"], ["ㅉ", "ㅈ"], ["ㅊ", "ㅈ"],
    ["ᄁ", "ᄀ"], ["ᄏ", "ᄀ"], ["ᄄ", "ᄃ"], ["ᄐ", "ᄃ"], ["ᄈ", "ᄇ"], ["ᄑ", "ᄇ"],
    ["ᄊ", "ᄉ"], ["ᄍ", "ᄌ"], ["ᄎ", "ᄌ"],
    ["ᆩ", "ᆨ"], ["ᆿ", "ᆨ"], ["ᇀ", "ᆮ"], ["ᇁ", "ᆸ"], ["ᆻ", "ᆺ"], ["ᆾ", "ᆽ"],
]

export const aspiratedLetters = [
    "ㅋ", "ㅋ", "ㅌ", "ㅌ", "ㅍ", "ㅍ", "ㅆ", "ㅊ", "ㅊ", "ㅎ",
    "ᄏ", "ᄏ", "ᄐ", "ᄐ", "ᄑ", "ᄑ", "ᄊ", "ᄎ", "ᄎ", "ᄒ",
    "ᆿ", "ᆿ", "ᇀ", "ᇁ", "ᆻ", "ᆾ", "ᇂ",
]

export const fortisLetters  = [
    "ㄲ", "ㄸ", "ㅃ", "ㅆ", "ㅉ",
    "ᄁ", "ᄄ", "ᄈ", "ᄊ", "ᄍ",
    "ᆩ", "ᆻ",
]

export const lenisLetters = [
    "ㄱ", "ㄷ", "ㅂ", "ㅅ", "ㅈ",
    "ᄀ", "ᄃ", "ᄇ", "ᄉ", "ᄌ",
    "ᆨ", "ᆮ", "ᆸ", "ᆺ", "ᆽ",
]

export const toDoubleConsonantMap = [
    ["ㄱ", "ㄲ"], ["ㄷ", "ㄸ"], ["ㅂ", "ㅃ"], ["ㅅ", "ㅆ"], ["ㅈ", "ㅉ"],
    ["ᄀ", "ᄁ"], ["ᄃ", "ᄄ"], ["ᄇ", "ᄈ"], ["ᄉ", "ᄊ"], ["ᄌ", "ᄍ"],
    ["ᆨ", "ᆩ"], ["ᆺ", "ᆻ"],
]

export const toSingleConsonantMap = [
    ["ㄲ", "ㄱ"], ["ㄸ", "ㄷ"], ["ㅃ", "ㅂ"], ["ㅆ", "ㅅ"], ["ㅉ", "ㅈ"],
    ["ᄁ", "ᄀ"], ["ᄄ", "ᄃ"], ["ᄈ", "ᄇ"], ["ᄊ", "ᄉ"], ["ᄍ", "ᄌ"],
    ["ᆩ", "ᆨ"], ["ᆻ", "ᆺ"],
]